fix: update mermaid from dot
