--- a/src/content/blog/2019-09-04_summary-alt-plan-insted-of-orwhere-about-firestore/index.md
+++ b/src/content/blog/2019-09-04_summary-alt-plan-insted-of-orwhere-about-firestore/index.md
@@ -156,35 +156,23 @@ type ViewableMessage = {
 
 関係性として、1 つの Message に対して、2 つの ViewableMessage の Document が存在する関係です。
 
-```dot
-digraph G{
-    compound=true
+```mermaid
+graph TD
+    style comment fill:none, stroke:none
 
-    node [shape=folder]
-    comment [label="ここの範囲で検索する", shape=none, fontsize=8]
-    text [shape=point, fontsize=8]
+    subgraph Message
+        M1[・senderID<br>・receiverID]
+    end
 
-    subgraph cluster_M {
-        label="Message"
-        M1 [label="・senderID\n・receiverID"]
-    }
-    subgraph cluster_VM {
-        label="ViewableMessage";
-        labelloc="b"
-        labeljust="l"
-        labelfloat="false"
-        bgcolor="gray";
-        margin=30
+    comment[ここの範囲で検索する]
+    subgraph ViewableMessage
+        VM1[userID=senderID]
+        VM2[userID=receiverID]
+    end
 
-        VM1 [label="userID=senderID"]
-        VM2 [label="userID=receiverID"]
-    }
-    M1->text
-    text->VM1
-    text->VM2
-
-    comment -> VM1 [lhead=cluster_VM]
-}
+    M1 --> VM1
+    M1 --> VM2
+    comment --> ViewableMessage
 ```
 
 データ生成については後述しますが、ひとまずデータも用意されている前提で話を進めます。
@@ -295,24 +283,21 @@ const message: Message = { id: snap.id, ...snap.data() };
 
 とはいえ、フィールドごとに見れば、単方向の関係性なので、そこまで問題はないかと思います。
 
-```dot
-digraph G {
-    subgraph cluster_Message{
-      label=Message
-      senderID -> V
-      receiver -> V [ label="トリガーでviewableUserIDsを更新"]
-      V [label=viewableUserIDs]
-    }
-}
+```mermaid
+graph TD
+    subgraph Message
+        senderID --> V
+        receiver -->|トリガーでviewableUserIDsを更新| V
+        V[viewableUserIDs]
+    end
 ```
 
 ### 所感
